mrwillem/MidiRelais/Utilities/STM32_EVAL/STM32F103C8T6/stm32f103c8t6_lcd_others.c
    LCD_WriteReg(LCD_REG_52, 0x01);
    LCD_WriteReg(LCD_REG_53, 0x00);
    LCD_WriteReg(LCD_REG_75, 0x00);
    LCD_WriteReg(LCD_REG_76, 0x00);
    LCD_WriteReg(LCD_REG_78, 0x00);
    LCD_WriteReg(LCD_REG_79, 0x00);
    LCD_WriteReg(LCD_REG_80, 0x00);
  
    LCD_WriteReg(LCD_REG_60, 0x00);
    LCD_WriteReg(LCD_REG_61, 0x00);
    LCD_WriteReg(LCD_REG_62, 0x01);
    LCD_WriteReg(LCD_REG_63, 0x3F);
    LCD_WriteReg(LCD_REG_64, 0x02);
    LCD_WriteReg(LCD_REG_65, 0x02);
    LCD_WriteReg(LCD_REG_66, 0x00);
    LCD_WriteReg(LCD_REG_67, 0x00);
    LCD_WriteReg(LCD_REG_68, 0x00);
    LCD_WriteReg(LCD_REG_69, 0x00);
    LCD_WriteReg(LCD_REG_70, 0xEF);
    LCD_WriteReg(LCD_REG_71, 0x00);
    LCD_WriteReg(LCD_REG_72, 0x00);
    LCD_WriteReg(LCD_REG_73, 0x01);
    LCD_WriteReg(LCD_REG_74, 0x3F);
  
    LCD_WriteReg(LCD_REG_29, 0x08);  /* R29:Gate scan direction setting */
  
    LCD_WriteReg(LCD_REG_134, 0x00);
    LCD_WriteReg(LCD_REG_135, 0x30);
    LCD_WriteReg(LCD_REG_136, 0x02);
    LCD_WriteReg(LCD_REG_137, 0x05);
  
    LCD_WriteReg(LCD_REG_141, 0x01);  /* R141:Register set-up mode for one line clock */
    LCD_WriteReg(LCD_REG_139, 0x20);  /* R139:One line SYSCLK number in one-line */
    LCD_WriteReg(LCD_REG_51, 0x01);  /* R51:N line inversion setting */
    LCD_WriteReg(LCD_REG_55, 0x01);  /* R55:Scanning method setting */
    LCD_WriteReg(LCD_REG_118, 0x00);
   
    /* Gamma Set -------------------------------------------------------------*/
    LCD_WriteReg(LCD_REG_143, 0x10);
    LCD_WriteReg(LCD_REG_144, 0x67);
    LCD_WriteReg(LCD_REG_145, 0x07);
    LCD_WriteReg(LCD_REG_146, 0x65);
    LCD_WriteReg(LCD_REG_147, 0x07);
    LCD_WriteReg(LCD_REG_148, 0x01);
    LCD_WriteReg(LCD_REG_149, 0x76);
    LCD_WriteReg(LCD_REG_150, 0x56);
    LCD_WriteReg(LCD_REG_151, 0x00);
    LCD_WriteReg(LCD_REG_152, 0x06);
    LCD_WriteReg(LCD_REG_153, 0x03);
    LCD_WriteReg(LCD_REG_154, 0x00);
  
    /* Display On ------------------------------------------------------------*/
    LCD_WriteReg(LCD_REG_1, 0x50);
    LCD_WriteReg(LCD_REG_5, 0x04);
    LCD_WriteReg(LCD_REG_0, 0x80);
    LCD_WriteReg(LCD_REG_59, 0x01);
    _delay_(4);  /* Delay 40 ms */
    LCD_WriteReg(LCD_REG_0, 0x20);
  }
  else if(LCDType == LCD_ILI9341)
  {
	  /* Set Display Reset */
	  //LCD_CtrlLinesWrite(LCD_SPI_MISO_PIN, LCD_SPI_MISO_PORT, Bit_SET);
	  //LCD_CtrlLinesWrite(LCD_SPI_MOSI_PIN, LCD_SPI_MOSI_PORT, Bit_SET);
	  LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET);
	  LCD_CtrlLinesWrite(LCD_NWR_GPIO_PORT, LCD_NWR_PIN, Bit_SET);
	  _delay_(1);
	  LCD_CtrlLinesWrite(LCD_NRST_GPIO_PORT, LCD_NRST_PIN, Bit_RESET);

	  _delay_(5); /* Delay 50 ms */
	  _delay_(5); /* Delay another 50 ms */
	  LCD_CtrlLinesWrite(LCD_NRST_GPIO_PORT, LCD_NRST_PIN, Bit_SET);
	  _delay_(5); /* Delay 50 ms */
	  _delay_(5); /* Delay 50 ms */
	  LCD_CtrlLinesWrite(LCD_NWR_GPIO_PORT, LCD_NWR_PIN, Bit_SET);
	  /* Start Initial Sequence ------------------------------------------------*/
	  _delay_(5); /* Delay 50 ms */
	  /* Issue Device Specific command */
	  LCD_WriteRegILI9341(0xCB);
	  LCD_WriteRAM(0x39);
	  LCD_WriteRAM(0x2C);
	  LCD_WriteRAM(0x00);
	  LCD_WriteRAM(0x34);
	  LCD_WriteRAM(0x02);

	  /* Issue another device specific command */
	  LCD_WriteRegILI9341(0xCF);
      LCD_WriteRAM(0x00);
      LCD_WriteRAM(0XC1);
      LCD_WriteRAM(0X30);

      LCD_WriteRegILI9341(0xE8);
      LCD_WriteRAM(0x85);
      LCD_WriteRAM(0x00);
      LCD_WriteRAM(0x78);

      LCD_WriteRegILI9341(0xEA);
      LCD_WriteRAM(0x00);
      LCD_WriteRAM(0x00);

      LCD_WriteRegILI9341(0xED);
      LCD_WriteRAM(0x64);
      LCD_WriteRAM(0x03);
      LCD_WriteRAM(0X12);
      LCD_WriteRAM(0X81);

      LCD_WriteRegILI9341(0xF7);
      LCD_WriteRAM(0x20);

      LCD_WriteRegILI9341(0xC0);    //Power control
      LCD_WriteRAM(0x23);   //VRH[5:0]

      LCD_WriteRegILI9341(0xC1);    //Power control
      LCD_WriteRAM(0x10);   //SAP[2:0];BT[3:0]

      LCD_WriteRegILI9341(0xC5);    //VCM control
      LCD_WriteRAM(0x3e);   //Contrast
      LCD_WriteRAM(0x28);

      LCD_WriteRegILI9341(0xC7);    //VCM control2
      LCD_WriteRAM(0x86);   //--

      LCD_WriteRegILI9341(0x36);    // Memory Access Control
      LCD_WriteRAM(0x48);   //C8	   //48 68//28 E8

      LCD_WriteRegILI9341(0x3A);
      LCD_WriteRAM(0x55);

      LCD_WriteRegILI9341(0xB1);
      LCD_WriteRAM(0x00);
      LCD_WriteRAM(0x18);

      LCD_WriteRegILI9341(0xB6);    // Display Function Control
      LCD_WriteRAM(0x08);
      LCD_WriteRAM(0x82);
      LCD_WriteRAM(0x27);

      /*
              LCD_WriteRegILI9341(0xF2);    // 3Gamma Function Disable
              LCD_WriteRAM(0x00);

              LCD_WriteRegILI9341(0x26);    //Gamma curve selected
              LCD_WriteRAM(0x01);

              LCD_WriteRegILI9341(0xE0);    //Set Gamma
              LCD_WriteRAM(0x0F);
              LCD_WriteRAM(0x31);
              LCD_WriteRAM(0x2B);
              LCD_WriteRAM(0x0C);
              LCD_WriteRAM(0x0E);
              LCD_WriteRAM(0x08);
              LCD_WriteRAM(0x4E);
              LCD_WriteRAM(0xF1);
              LCD_WriteRAM(0x37);
              LCD_WriteRAM(0x07);
              LCD_WriteRAM(0x10);
              LCD_WriteRAM(0x03);
              LCD_WriteRAM(0x0E);
              LCD_WriteRAM(0x09);
              LCD_WriteRAM(0x00);

              LCD_WriteRegILI9341(0XE1);    //Set Gamma
              LCD_WriteRAM(0x00);
              LCD_WriteRAM(0x0E);
              LCD_WriteRAM(0x14);
              LCD_WriteRAM(0x03);
              LCD_WriteRAM(0x11);
              LCD_WriteRAM(0x07);
              LCD_WriteRAM(0x31);
              LCD_WriteRAM(0xC1);
              LCD_WriteRAM(0x48);
              LCD_WriteRAM(0x08);
              LCD_WriteRAM(0x0F);
              LCD_WriteRAM(0x0C);
              LCD_WriteRAM(0x31);
              LCD_WriteRAM(0x36);
              LCD_WriteRAM(0x0F);
      */
      LCD_WriteRegILI9341(0x11);    //Exit Sleep
      _delay_(12);

      LCD_WriteRegILI9341(0x29);    //Display on
      LCD_WriteRegILI9341(0x2c);
      _delay_(1);
  }

